"""
Определить индексы элементов массива (списка),
значения которых принадлежат заданному диапазону
(т.е. не меньше заданного минимума и не больше заданного максимума)
Ввод:  [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7] 5 10
Вывод: [1, 9, 13, 14, 19]
"""

data = [int(x) for x in input("Введите значения массива: ").split()]
limits = [int(x) for x in input("Введите минимум и максимум диапазона: ").split()]

result = []
for i in range(len(data)):
    if limits[0] <= data[i] <= limits[1]:
        result.append(i)
print(result)
